# QUESTION 1:

Samantha interviews many candidates from different colleges using
challenges and contests. Write a query to print the contest_id, hacker_id,
name, and the sums of total_submissions, total_accepted_submissions,
total_views, and total_unique_views for each contest sorted by contest_id.
Exclude the contest from the result if all four sums are 0.

In [1]:
# import image module
from IPython.display import Image
  
# get the image
Image(url="QUESTION_1.png", width=800, height=800)

select con.contest_id, con.hacker_id, con.name, 
       sum of total_submissions, 
       sum of total_accepted_submissions, 
       sum of total_views, sum of total_unique_views
        
    from contests con 

        join colleges col on con.contest_id = col.contest_id 

        join challenges cha on col.college_id = cha.college_id 

        left join (select challenge_id, sum(total_views) as sum of total_views, sum(total_unique_views) as sum of total_unique_views from view_stats group by challenge_id) vs on cha.challenge_id = vs.challenge_id 

        left join (select challenge_id, sum(total_submissions) as sum of total_submissions, sum(total_accepted_submissions) as sum of total_accepted_submissions from submission_stats group by challenge_id) ss on cha.challenge_id = ss.challenge_id

    group by con.contest_id, con.hacker_id, con.name
        
    having sum of total_submissions !=0 or 
           sum of total_accepted_submissions !=0 or
           sum of total_views !=0 or
           sum of total_unique_views !=0

    order by contest_id

# QUESTION 2:

Write Clean the dataset and update the csv file (replace all column values
which contain ?, n.a, or Nan).
Count total cars per company.
File csv: TEST_DATA.csv. (Program: Python)

## Replace all column values which contain ?, n.a, Nan

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('data.csv')

In [4]:
df.head(10)

   index company name  price
0      0      C1   1A  13495
1      1      C1   1B  16500
2      2      C1    ?  16500
3      3     n.a   2A  13950
4      4     Nan   2B  17450
5      5      C3  NaN  15250
6      6      C4   4A  18920
7      9     n.a   4B  16430
8     10      C4   4C  16925

In [5]:
df['company'].value_counts()

C1     3
n.a    2
C4     2
Nan    1
C3     1
Name: company, dtype: int64

Pandas consider n.a, Nan as company's name

In [6]:
for col in df.columns:
    missing_data = df[col].isna().sum()
    perc = missing_data / len(df) * 100
    print(f"Column {col}: has {missing_data} missing entries, {perc}%")

Column index: has 0 missing entries, 0.0%
Column company: has 0 missing entries, 0.0%
Column name: has 1 missing entries, 11.11111111111111%
Column price: has 0 missing entries, 0.0%

Pandas consider #N/A, -NaN, -n/a, N/A, NULL etc as NaN value

Pandas not consider ?, n.a, Nan as NaN

### Using na_values to replace all comlumn values which contain ?, n.a, Nan

The na_values parameter is used to tell pandas they consider “?,n.a,Nan” as NaN value and print NaN at the place of “?,n,a,Nan”

In [7]:
# creat collection
set = {"?","n.a","Nan"}
# read a csv file
df_1 = pd.read_csv('data.csv', na_values = set)

In [8]:
# show the dataframe
print(df_1)

   index company name  price
0      0      C1   1A  13495
1      1      C1   1B  16500
2      2      C1  NaN  16500
3      3     NaN   2A  13950
4      4     NaN   2B  17450
5      5      C3  NaN  15250
6      6      C4   4A  18920
7      9     NaN   4B  16430
8     10      C4   4C  16925

## Count total cars per company

In [9]:
df_1['company'].value_counts()

C1    3
C4    2
C3    1
Name: company, dtype: int64

# QUESTION 3:

You are given an array prices where prices[i] is the price of a given stock on
the i-th day. You want to maximize your profit choosing a single day to buy
one stock and choosing a different day in the future to sell that stock.
Return the maximum profit you can achieve from this transaction. If you
cannot achieve any profit, return 0. (Program: Python)

In [10]:
list=[7,1,5,3,6,4]
def maxProfit():
    max=0
    for i in range (len(list)):
        for j in range ( i+1, len(list)):
            profit =  list [j] - list [i]
            if profit > max:
                max = profit
    print ("max profit = ",max)

In [11]:
maxProfit()

max profit =  5